       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN CUSTOM-ATTRIBUTE CA-STATHREAD.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           CUSTOM-ATTRIBUTE CA-STATHREAD CLASS CLASS-STATHREADATTRIBUTE
           .
       REPOSITORY.
           CLASS CLASS-APPLICATION AS "System.Windows.Forms.Application"
           CLASS CLASS-MAINFORM AS "AsyncSample.COBOL.Form1"
           CLASS CLASS-STATHREADATTRIBUTE AS "System.STAThreadAttribute"
           .
      
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WK-MAINFORM OBJECT REFERENCE CLASS-MAINFORM.
       PROCEDURE DIVISION.
           INVOKE CLASS-APPLICATION "EnableVisualStyles".
           INVOKE CLASS-APPLICATION "SetCompatibleTextRenderingDefault" USING BY VALUE B"0".
      
           INVOKE CLASS-MAINFORM "NEW" RETURNING WK-MAINFORM.
           INVOKE CLASS-APPLICATION "Run" USING BY VALUE WK-MAINFORM.
       END PROGRAM MAIN.
